import getpass
import sys
import random
import os



print("Введите имя персонажа")
name = input()
a = f"{name} стоит перед вратами Цитадели Ледяной Короны  вместе с магом Роркханом и жрицой по имени Миратина, а так же с легендарным паладином Тирионом Фордрингом и небольшим отрядом рыцарей из Сребрянного Авангарда"
print(a)
print("1.Войти \n 2.Уйти")
b = int(input())
match b:
        case 1 :
            print("Вы проходите через врата")

        case 2 :
            sys.exit("Трус")
print("Пока армии Альянса и Орды сражаются с армией Короля-лича, Вы должны будите сокушить Коорля лича и его творения и спасти Азерот от Плети")
print("Ваш немногчисленный отряд состит из опытного паладина, огненного мага, и жреца")
print ("Тирион Фордринг: Вот мы и на месте, То, что произойдет здесь, войдет в легенды.Не важно, каким будет исход: для истории мы будем героями,сражавшимися за свободу и покой нашего народа")
print("Тирион Фордринг: Помните,герои: страх -ваш самый опсный противник в этих проклятых залах.Скрепите свои сердца, и ваши души воссияют ярче тысячи солнц,завидев вас,варг отступит.Враг падет когда Свет праведности кочнется его")
print("Enter для продолжения")
m = getpass.getpass
m = input()
print("Как только вы проходите в Цитадель на вас сразу сбегается полчища древних воинов-скелетов и скелетов-чародеев")
print("Бой не избежен")
Sposobnosti_p = ["Ваши способности:", "1.\\Удары Воина света\\" , "2.\\Испепеляющий след\\","3.\Божественная буря\""]

import random
Sposobnosti_p = ["Ваши способности:", "1.\\Удары Воина света\\" , "2.\\Испепеляющий след\\","3.\Божественная буря\""]

print(Sposobnosti_p)


sposobnost = Sposobnosti_p.index("1.\\Удары Воина света\\")
sposobnost = Sposobnosti_p.index("2.\\Испепеляющий след\\")
sposobnost = Sposobnosti_p.index("3.\Божественная буря\"")

sposobnost = int(input())
random_number = random.randint (0,1)



if sposobnost == 1:
    if random_number==0:
        print("Вы наносите размашистые удары мечом, но воины-скелеты уварачиваются,блокирубт и парируют ваши удары")
    elif random_number==1:
         print("Вы наносите размашистые удары мечом, разрубая нежить на двое")
elif sposobnost == 2:
   print("Вы делаете выпад с мечом, который излучет волну Свет, обращая нежить в прах ")

elif sposobnost == 3:
     print("Вы создаете несколько вихрей божественой энергии и запускаете в орду, ломая и испепеляя нежить ")
Sposobnosti_m = ["способности мага :", "1.\\Огненный шар\\" , "2.\\Огненный столб\\","3.\огненные фениксы\""] 
print(Sposobnosti_m)  
sposobnost_mage = Sposobnosti_m.index("1.\\Огненный шар\\" )
sposobnost_mage = Sposobnosti_m.index("2.\\Огненный столб\\")
sposobnost_mage = Sposobnosti_m.index("3.\огненные фениксы\"")

sposobnost_mage = int(input())
random_number_mage = random.randint (0,1)
if sposobnost_mage == 1:
    if random_number_mage==0:
        print("Маг выпускает огненный шар, но нежить уварачивется от него")
    elif random_number_mage==1:
         print("Маг выпускает огненный шар который прожинает толпу скелетов на сквозь")
elif sposobnost_mage == 2:
   print("Маг вызывает огнненые взрывы в виде столбов сжигая слуг Короля-лича ")

elif sposobnost_mage == 3:
     print("Маг выпускает в нежить огненных птиц,которые влитает в толпу нежити и взрывается ")

Sposobnosti_prist = ["способности жрицы:", "1.\\Вспышка света\\" , "2.\\Кольцо света\\","3.\Божественная звезда\""]
print (Sposobnosti_prist)
Sposobnosti_p = Sposobnosti_prist.index("1.\\Вспышка света\\" )
Sposobnosti_p = Sposobnosti_prist.index("2.\\Кольцо света\\")
Sposobnosti_p = Sposobnosti_prist.index("3.\Божественная звезда\"")
Sposobnosti_p = int(input())
if Sposobnosti_p == 1:
    print("Жрица взыввет к свету и обрушивает небольшой пучок света на нежить")
elif Sposobnosti_p == 2:
   print("Жрица вызывет вокруг себя взрыв света, который излечивает раны союзников и обрушивает шрапнель из света на нежить,пробивая толпу насквозь ")

elif Sposobnosti_p == 3:
     print("Жрица выпускает в одного из союзников божественную звезду которая лечит союзника и прожигает нежить")
     print("Цель божественной звезды")
     g = f"1.{name}"
     print(g)
     print("2.Роркхан")
     j = int (input())
     if j == 1:
         print("Жрица выпускает божественную звезду в Роркхана, которя лечит мага и прожигает толпу нежити  ")
     else :
       g = f"Жрица выпускает божественную звезду в {name}, которя лечит мага и прожигает толпу нежити" 
       print(g)
       
prichina = sposobnost == 1 and random_number== 1 and (sposobnost_mage == 1 and random_number_mage==0)
prichina_dva =sposobnost == 1 and random_number== 0 and sposobnost_mage == 1 and sposobnost_mage ==1 
prichina_tri = sposobnost == 1 and random_number== 0 and sposobnost_mage == 1 and sposobnost_mage ==0
if (sposobnost == 1 and random_number== 1 or sposobnost == 2 or sposobnost ==3)  and (sposobnost_mage == 1 and random_number_mage==1 or sposobnost_mage == 2 or sposobnost_mage == 3) :
    print("Грамматно использовав свои способности Герои уничтожили орду нежити не два им и шанса")
elif  prichina:
    print("Герои не смогли уничтожить толпу нежите и тепрерь они рвуться на вас")
elif  prichina_dva:
    print("Герои не смогли уничтожить толпу нежити и тепрерь они рвуться на вас")
elif  prichina_tri:
    print("Герои не смогли уничтожить толпу нежити и тепрерь они рвуться на вас")    
if prichina == True or prichina_dva == True or prichina_tri == True:
        print("скелеты атакует ваш отряд")
        random_number_protivnika = random.randint (1,2)
        if  random_number_protivnika == 1:
           print("Остатки скелетов аткуют паладина")
           Sposobnosti_zachiti_paladina = [ "Способности :","1.\\Щит возмездия\\" , "2.\Не делать ничего\"" ]
           print(Sposobnosti_zachiti_paladina)
           qte = Sposobnosti_zachiti_paladina.index("1.\\Щит возмездия\\")
           qte = Sposobnosti_zachiti_paladina.index("2.\Не делать ничего\"")
           qte = int(input())
           if qte == 1:
               print("Паладин окуружает себя щитом Света.После этого на вас обрушивется орда скелетов которые за щитанные секунды пробивают щит, который взрывается ,пронзая насквозь нежить лучами Света")
           if qte == 2:
                random_number_gg= random.randint (1,3)
                if  random_number_gg == 1:
                    print( "Паладин с легость парирует и блокирут все атаки скелетов ")
                    print("Пока паладин защищался, маг с жрицей добили остатки нежети")
                elif random_number_gg == 2:
                    print("Паладин пытается парировать и блокировать атаки, но скелеты берут числом поподая по паладину, но освещенные латы держат удар, не давая вам получить урон")
                    print("Пока паладин защищался, маг с жрицей добили остатки нежети")
                elif  random_number_gg == 3:
                    print("Паладин пытается парировать и блокировать атаки, но скелеты берут числом,поподая по паладину и пробиваю броню своими клинками, и накося рваные,колящие и рубящие удары" )
                    print("Пока паладин защищался, маг с жрицей добили остатки нежети")
                    

        if  random_number_protivnika == 2 :
            print("Остатки скелетов-воинов пытаются дойти до Роркхана и Ирлиуры")
            print("У вас есть мгновенье что бы что-нибудь сделать")
            Sposobnosti_zachiti = [ "","1.\\Ментальный крик\\" , "2.\\Кольцо льда\\","3.\Дыхание дракона\""]
            print(Sposobnosti_zachiti)
            Sposobnosti_z = Sposobnosti_zachiti.index("1.\\Ментальный крик\\")
            Sposobnosti_z = Sposobnosti_zachiti.index("2.\\Кольцо льда\\")
            Sposobnosti_z = Sposobnosti_zachiti.index("3.\Дыхание дракона\"")
            Sposobnosti_z = int(input())
            if Sposobnosti_z == 1:
                print("Ирлиура создает ментальный крик обращая нежить в бегство, после чего отряд добивет одиночных скелетов-воинов")    
            if Sposobnosti_z == 2:
                random_number_ranomnoe_sobitie = random.randint (1,10)
                print("Роркхан образует возле себя кольцо льда примораживая врагов к земле")
                if random_number_ranomnoe_sobitie >= 4 :
                    print("После чего отряд добивает нечесть")
                elif random_number_ranomnoe_sobitie <= 3:
                    print("Несколько скелетов поняли замысел мага, окружив его и нанеся пару ударов,но не с умели сбить заклинание и были приморожены.После чего Герои добили остатки нежети")
                   
            if Sposobnosti_z == 3:
                print("Маг выдыхает драконний огонь дезарентирую врагов,после чего добить едва ходящих скелетов, не соствило проблем")

print("Ваш отряд доходите до Лорда Рембрада")
print("Неожидано к вам приходит подкрепление. Это рыцарь смерти Мадрета из ""Черных Клинов"". ")
print("Когда Король-лич начал утрачивать власть над рыцарями смерти, его бывшие солдаты обрели новое предназначение, став рыцарями Черного Клинка, и объденившись с Ордой и Альянсом в войне против него")
print(" Король-лич создал Ребрада из костей тысяч пропавших искателей приключений, и теперь он охраняет Ледяной Трон у подножья Шпиля, наполненный силой самого трона.")
print ("Нужно убить это отродье  и освободить души несчастных")
print ("Лорд Рембрад : Смертные, ваш путь закончится, так и не начавшись! Никто не смеет входить в обитель господина!")
print("Ваш отряд бросается в бой с чудовищем Короля-Лича. Пока паладин принимает урон Роркхан и Мадрета наносят урон, пока жрица поддерживает магией")
print("Несколько минут бой проходит удачно.Удары Лорда Рембрада поподают либо мимо, либо броня выдерживает их")
print("Внезапно Лорд Ребрад кричит")
print("Лорд Рембрад : ВИХРЬ КОСТЕЙ")
print("Что делать : 1)Отойти подальше , 2)Держать позиции")
vubor = int (input())
if vubor == 1:
    print("Отряд отбегает от Лорда Рембрада.")
    print("Спустя секунду как последний боец отбежал Лорд Рембрант начинает кружиться в вихре костей, пытаясь атаковать ближайших противников")
elif vubor == 2:
    print("Герои не обратили внимание на слова слуги Плети")
    print("И Лорд Рембрант собирается закружиться в вихре костей")
    print("Что делать : 1)Попытаться отступить 2)Приготовиться защищаться")
    podvubor = int(input())
    if podvubor == 1:
    
        print("Герои пытаются выйти из препологаемой области удара, но они не успевают")
        print("Паладина и рыцаря смерти откинула в стену.Удар был настолько сильный что часть зачаровынных доспехов паладина разбиваются.Шлем был расколот, кираса треснула, а один из наплечей отлетел и помялся .Маг воспользовался Скачком и телепартировал себя с жрицей на безопасное растояние")
    
    elif podvubor == 2:
        print("Паладин и рыцарь смерти накладывают на себя защитные заклинания.Паладин призывает ""Божественный щит"", а рыцарю смерти помагают Роркхан,накладываю на него огненный барьер, и Миратина, накладывая на него слово силы:Щит ")
        print("Пока Лорд Рембрант кружился в вихре костей, Роркхан и Миратина выжигают его с помощью огня и Света.")
print("Герои вновь вступают в бой с Лордом Рембрадом")
print("Лорд Рембранд : Костяная хватка!.")
print("Металлический пол наичанет дрожать и ...")
random_number_sobitia_dva= random.randint (1,4)
if random_number_sobitia_dva == 1:
    print("костяной шип вырывается из пола, пронзая паладина. Жрица отчаянно пытается спасти жизнь паладину ")
    print("1)Можно попытаться освободить паладина или 2)добить Лорда Рембрада")
    vashnoe_sobitia = int(input())
    if vashnoe_sobitia == 1:
        print("Герои вывобождают паладина и бой продолжается")
    elif  vashnoe_sobitia == 2:
        print("Отряд решает воспользоваться моментом и добить лорда.Им это удается, но Жрице не хватило сил спасти паладина")
        print("Паладин умирает")
        
        
elif random_number_sobitia_dva == 2:
    print("костяной шип вырывается из пола, пронзая Мадрету.Жрица отчаянно пытается спасти жизнь рыцарю смерти ")
    print("1)Можно попытаться освободить рыцаря смерти или 2)добить Лорда Рембрада")
    vashnoe_sobitia = int(input())
    if vashnoe_sobitia == 1:
        print("Герои вывобождают рыцаря смерти и бой продолжается")
    if  vashnoe_sobitia == 2:
        print("Отряд решает воспользоваться моментом и добить лорда.Им это удается, но Жрице не хватило сил спасти рыцаря смерти")
        print("Мадрета : за Азерот")
        print("рыцарь смерти умирает")

elif random_number_sobitia_dva == 3:
    print("костяной шип вырывается из пола, пронзая Роркхана.Жрица отчаянно пытается спасти жизнь магу ")
    print("1)Можно попытаться освободить мага или 2)добить Лорда Рембрада")
    vashnoe_sobitia = int(input())
    if vashnoe_sobitia == 1:
        print("Герои вывобождают мага и бой продолжается")
    if  vashnoe_sobitia == 2:
        print("Отряд решает воспользоваться моментом и добить лорда.Им это удается, но Жрице не хватило сил спасти мага")
        print("Маг умирает")
elif random_number_sobitia_dva == 4:
    print("костяной шип вырывается из пола, пронзая Миратину.Жрица отчаянно пытается спасти свою жизнь ")
    print("1)Можно попытаться освободить жрицу или 2)добить Лорда Рембрада")
    vashnoe_sobitia = int(input())
    if vashnoe_sobitia == 1:
        print("Герои вывобождают Жрицу и бой продолжается")
    elif  vashnoe_sobitia == 2:
       
        print("Отряд решает воспользоваться моментом и добить лорда.Им это удается, но Жрице не хватило сил спасти себя")
        print("Миратина : Свет спаси мою душу")
if vashnoe_sobitia == 2:
    print( "Пока Лорд Рембрант кружился в вихре костей, герои выжги его с помощью магии.")
    print("Лорд Рембрант: Я вижу... лишь тьму..")
elif vashnoe_sobitia == 1:
    print("Несколько минут бой проходит удачно.Удары Лорда Рембрада поподают либо мимо, либо броня выдерживает их")
    print("Внезапно Лорд Ребрад кричит")
    print("Лорд Рембрад : ВИХРЬ КОСТЕЙ")
    print("Что делать : 1)Отойти подальше , 2)Держать позиции")
    vubor = int (input())
    if vubor == 1:
        print("Отряд отбегает от Лорда Рембрада.")
        print("Спустя секунду как последний боец отбежал Лорд Рембрант начинает кружиться в вихре костей, пытаясь атаковать ближайших противников")
    elif vubor == 2:
        print("Герои не обратили внимание на слова слуги Плети")
        print("И Лорд Рембрант собирается закружиться в вихре костей")
        print("Что делать : 1)Попытаться отступить 2)Приготовиться защищаться")
        podvubor = int(input())
        
        if podvubor == 1:
            print("Герои пытаются выйти из препологаемой области удара, но они не успевают")
            
            print("Паладина и рыцаря смерти откинула в стену.Удар был настолько сильный что часть зачаровынных доспехов паладина разбиваются .Маг воспользовался Скачком и телепартировал себя с жрицей на безопасное растояние")
        elif podvubor == 2:
            print("Герои успешно миновали Вихрь костей")
    if vubor == 2:
        print("Паладин и рыцарь смерти накладывают на себя защитные заклинания.Паладин призывает ""Божественный щит"", а рыцарю смерти помагают Роркхан,накладываю на него огненный барьер, и Миратина, накладывая на него слово силы:Щит ")

    print("Пока Лорд Рембрант кружился в вихре костей, герои выжги его с помощью магии.")
    print("Лорд Рембрант: Я вижу... лишь тьму..")

print("После этих слов Лорд Рембрант рассыпается на на тысячи костей")
print("Путь свободен")
print("Нажмите Enter для продолжения")
y = (input())
print("Вы доходите до леденого трона")
print("Вы видите искалеченного Болвара Фордрагона")
print("Как выяснилось позже, Плеть захватила Болвара и он подвергся безжалостным пыткам. Несмотря на активные усилия слуг лича, Болвару долгое время удавалось сопротивляться.")
print("Сам Король-Лич встречает вас")
print("Король-лич является владыкой и повелителем Плети, которой он телепатически правит со своего Ледяного Трона, стоящего на верхушке Цитадели Ледяной Короны.")
print("Когда-то Король-лич был Артасом Менетилом  кронпринц Лордерона и рыцарь Cеребряной Длани. Был сыном короля Теренаса Менетила II и являлся будущим наследником трона Лордерона.")
print(" Многие верили, что юному принцу суждено принести свет и процветание на земли его отца. С малых лет Утер Светоносный обучал его бравому делу паладина и прививал рыцарские идеалы, дабы сделать из него достойного человека и Короля. ")
print("несмотря на многообещающее начало жизни, после его предательства и объединения с Королём-личом Артас стал одним из самых ужасных созданий, когда-либо встречавшихся на просторах Азерота.")
if random_number_sobitia_dva == 1 and vashnoe_sobitia == 2:
    print ("Мы дожны отсановить его и отомтить за нашего паладина")
elif random_number_sobitia_dva == 4 and vashnoe_sobitia == 2:
     print ("Мы дожны отсановить его и отомтить за Миратину")    
print("Король-лич : Неужели прибыли наконец хваленные силы Света?.Мне броить Ледяную Скорбь и сдаться на твою милость, Фордринг  ")
print("Тирион Фордринг : Мы даруем тебе быструю смерть, Артас. Более быстрою, чем ты заслуживаешь за то , что замучил и погубил десятки тысяч душ" )
print("Король-лич :Ты пройдешь через эти мучения сам. и будешь молить о пощаде, но я не буду слушать.Твои  отчаянные крики послужат доказательством моей безграничной мощи")
print("Тирион Фордринг : Да будет так, герои в атаку")
print("Тирион бросается в атаку но Король-лич заковывает его в ледянную глыбу и вступает в бой с вами")
print("Герои бросаются в бой с Королем-личом")
if random_number_sobitia_dva == 1 and vashnoe_sobitia == 2:
    print("Рыцарь смерти мастерски противостоит королю-личу в ближнем бою пока Роркхан и Миратина пытаются пробить темную броню")
    print("Король-лич : Ты отлично обучил их ,Фордринг. Ты привел сюда лучших воинов, которых занл мир- и отдал их в мои руки, как я и рассчитывал")
    print("Король-лич : Смотри, как я буду воскрешать их и превращать в воинов Плети. Они повергнут этот  мир в пучину хаоса.Азерот падет от их рук, и ты станешь первой жертовой")
    print("Тирион Фордринг : Свет,даруй мне последнее благославление.Дай мне силу разрушить эти оковы")
    print("Леденая глыба в которой был заключен Тирион ломается")
    print("Тирион делает выпад Испепелителем ломая Ледяную Скорьб")
    print("Тысячи душ вырываются из меча добивая Владыку Плети")
    print("Артас Менетил : Отец все позади?")
    print("Теренаса Менетила II : Теперь да")
    print("Теренаса Менетила II  : Короли не правят вечно,сын мой ")
    print("Артас Менетил : Мой взор застилает тьма")
    print("Теренаса Менетила II  : Теперь когда плеть лишилась своего короля, она станет еще опасней")
    print("Теренаса Менетила II  : Ей нужен правитель")
    print("Теренаса Менетила II  : Всегда должен быть Король-лич")
    print("После этих слов дух его исчезает")
    print("Тирион поднимает Корону Господства")
    print("Тирион Фордринг : Это тяжкое бремя я возьму на себя.Ибо никто другой ..... ")
    print("Болвар Фордрагон : Тирион! Брат мой, в твоих руках суровый рок, но это не твоя судьба.")
    print("Обожженная фигура Болвара корчится на вершине Ледяного Трона.")
    print("Тирион Фордринг: Болвар!")
    print("Тирион Фордринг: Во имя всего святого...")
    print("Болвар Фордрагон: Пламя драконов определило мою судьбу. Мир живых уже не для меня. Возложи корону на мою голову, Тирион. Отныне я стану стражем Проклятых.")
    print("Тирион Фордринг: Нет, мой друг. Я не могу.")
    print("Болвар Фордрагон: Давай же, Тирион!")
    print("Болвар Фордрагон: И тебя и этих храбрых героев ждет иная судьба. А эту последнюю жертву принесу я.")
    print("Тирион поворачивается к Болвару и поднимает над ним Шлем Господства.")
    print("Тирион Фордринг: Тебя не забудут, брат.")
    print("Болвар Фордрагон: Обо мне нужно забыть, Тирион. Если миру суждено освободится от власти страха, никто не должен узнать, что произошло здесь сегодня!")
    print("Тирион выполняет требование Болвара и надевает на него Шлем Господства. Комната начинает трястись и Болвар поднимает голову: из его глаз идет золотистое свечение.")
    print("Болвар Фордрагон: Объяви что Король-лич мертв.")
    print("Голос Болвара постепенно становится похожим на голос Короля-лича.")
    print("Болвар Фордрагон/Король-лич: И вместе с ним умер Болвар Фордрагон.")
    print("Ледяной Трон сковывает в глыбу Болвара.")
    print("Болвар Фордрагон/Король-лич: А теперь уходи! И не возвращайся, никогда!")
elif random_number_sobitia_dva == 2 and vashnoe_sobitia == 2:
    print("Паладин мастерски противостоит королю-личу в ближнем бою пока Роркхан и Миратина пытаются пробить темную броню")
    print("Король-лич : Ты отлично обучил их ,Фордринг. Ты привел сюда лучших воинов, которых занл мир- и отдал их в мои руки, как я и рассчитывал")
    print("Король-лич : Смотри, как я буду воскрешать их и превращать в воинов Плети. Они повергнут этот  мир в пучину хаоса.Азерот падет от их рук, и ты станешь первой жертовой")
    print("Тирион Фордринг : Свет,даруй мне последнее благославление.Дай мне силу разрушить эти оковы")
    print("Леденая глыба в которой был заключен Тирион ломается")
    print("Тирион делает выпад Испепелителем ломая Ледяную Скорьб")
    print("Тысячи душ вырываются из меча добивая Владыку Плети")
    print("Артас Менетил : Отец все позади?")
    print("Теренаса Менетила II : Теперь да")
    print("Теренаса Менетила II  : Короли не правят вечно,сын мой ")
    print("Артас Менетил : Мой взор застилает тьма")
    print("Теренаса Менетила II  : Теперь когда плеть лишилась своего короля, она станет еще опасней")
    print("Теренаса Менетила II  : Ей нужен правитель")
    print("Теренаса Менетила II  : Всегда должен быть Король-лич")
    print("После этих слов дух его исчезает")
    print("Тирион поднимает Корону Господства")
    print("Тирион Фордринг : Это тяжкое бремя я возьму на себя.Ибо никто другой ..... ")
    print("Болвар Фордрагон : Тирион! Брат мой, в твоих руках суровый рок, но это не твоя судьба.")
    print("Обожженная фигура Болвара корчится на вершине Ледяного Трона.")
    print("Тирион Фордринг: Болвар!")
    print("Тирион Фордринг: Во имя всего святого...")
    print("Болвар Фордрагон: Пламя драконов определило мою судьбу. Мир живых уже не для меня. Возложи корону на мою голову, Тирион. Отныне я стану стражем Проклятых.")
    print("Тирион Фордринг: Нет, мой друг. Я не могу.")
    print("Болвар Фордрагон: Давай же, Тирион!")
    print("Болвар Фордрагон: И тебя и этих храбрых героев ждет иная судьба. А эту последнюю жертву принесу я.")
    print("Тирион поворачивается к Болвару и поднимает над ним Шлем Господства.")
    print("Тирион Фордринг: Тебя не забудут, брат.")
    print("Болвар Фордрагон: Обо мне нужно забыть, Тирион. Если миру суждено освободится от власти страха, никто не должен узнать, что произошло здесь сегодня!")
    print("Тирион выполняет требование Болвара и надевает на него Шлем Господства. Комната начинает трястись и Болвар поднимает голову: из его глаз идет золотистое свечение.")
    print("Болвар Фордрагон: Объяви что Король-лич мертв.")
    print("Голос Болвара постепенно становится похожим на голос Короля-лича.")
    print("Болвар Фордрагон/Король-лич: И вместе с ним умер Болвар Фордрагон.")
    print("Ледяной Трон сковывает в глыбу Болвара.")
    print("Болвар Фордрагон/Король-лич: А теперь уходи! И не возвращайся, никогда!")
elif random_number_sobitia_dva == 3 and vashnoe_sobitia == 2:
    print("Паладин и рыцарь сметри мастерски противостоит королю-личу в ближнем бою пока  Миратина пытается пробить темную броню")
    print("Король-лич : Ты отлично обучил их ,Фордринг. Ты привел сюда лучших воинов, которых занл мир- и отдал их в мои руки, как я и рассчитывал")
    print("Король-лич : Смотри, как я буду воскрешать их и превращать в воинов Плети. Они повергнут этот  мир в пучину хаоса.Азерот падет от их рук, и ты станешь первой жертовой")
    print("Тирион Фордринг : Свет,даруй мне последнее благославление.Дай мне силу разрушить эти оковы")
    print("Леденая глыба в которой был заключен Тирион ломается")
    print("Тирион делает выпад Испепелителем ломая Ледяную Скорьб")
    print("Тысячи душ вырываются из меча добивая Владыку Плети")
    print("Артас Менетил : Отец все позади?")
    print("Теренаса Менетила II : Теперь да")
    print("Теренаса Менетила II  : Короли не правят вечно,сын мой ")
    print("Артас Менетил : Мой взор застилает тьма")
    print("Теренаса Менетила II  : Теперь когда плеть лишилась своего короля, она станет еще опасней")
    print("Теренаса Менетила II  : Ей нужен правитель")
    print("Теренаса Менетила II  : Всегда должен быть Король-лич")
    print("После этих слов дух его исчезает")
    print("Тирион поднимает Корону Господства")
    print("Тирион Фордринг : Это тяжкое бремя я возьму на себя.Ибо никто другой ..... ")
    print("Болвар Фордрагон : Тирион! Брат мой, в твоих руках суровый рок, но это не твоя судьба.")
    print("Обожженная фигура Болвара корчится на вершине Ледяного Трона.")
    print("Тирион Фордринг: Болвар!")
    print("Тирион Фордринг: Во имя всего святого...")
    print("Болвар Фордрагон: Пламя драконов определило мою судьбу. Мир живых уже не для меня. Возложи корону на мою голову, Тирион. Отныне я стану стражем Проклятых.")
    print("Тирион Фордринг: Нет, мой друг. Я не могу.")
    print("Болвар Фордрагон: Давай же, Тирион!")
    print("Болвар Фордрагон: И тебя и этих храбрых героев ждет иная судьба. А эту последнюю жертву принесу я.")
    print("Тирион поворачивается к Болвару и поднимает над ним Шлем Господства.")
    print("Тирион Фордринг: Тебя не забудут, брат.")
    print("Болвар Фордрагон: Обо мне нужно забыть, Тирион. Если миру суждено освободится от власти страха, никто не должен узнать, что произошло здесь сегодня!")
    print("Тирион выполняет требование Болвара и надевает на него Шлем Господства. Комната начинает трястись и Болвар поднимает голову: из его глаз идет золотистое свечение.")
    print("Болвар Фордрагон: Объяви что Король-лич мертв.")
    print("Голос Болвара постепенно становится похожим на голос Короля-лича.")
    print("Болвар Фордрагон/Король-лич: И вместе с ним умер Болвар Фордрагон.")
    print("Ледяной Трон сковывает в глыбу Болвара.")
    print("Болвар Фордрагон/Король-лич: А теперь уходи! И не возвращайся, никогда!")
elif random_number_sobitia_dva == 4 and vashnoe_sobitia == 2:
    print("Паладин и рыцарь сметри мастерски противостоит королю-личу в ближнем бою пока Роркхан пытается пробить темную броню")
    print("Король-лич : Ты отлично обучил их ,Фордринг. Ты привел сюда лучших воинов, которых занл мир- и отдал их в мои руки, как я и рассчитывал")
    print("Король-лич : Смотри, как я буду воскрешать их и превращать в воинов Плети. Они повергнут этот  мир в пучину хаоса.Азерот падет от их рук, и ты станешь первой жертовой")
    print("Тирион Фордринг : Свет,даруй мне последнее благославление.Дай мне силу разрушить эти оковы")
    print("Леденая глыба в которой был заключен Тирион ломается")
    print("Тирион делает выпад Испепелителем ломая Ледяную Скорьб")
    print("Тысячи душ вырываются из меча добивая Владыку Плети")
    print("Артас Менетил : Отец все позади?")
    print("Теренаса Менетила II : Теперь да")
    print("Теренаса Менетила II  : Короли не правят вечно,сын мой ")
    print("Артас Менетил : Мой взор застилает тьма")
    print("Теренаса Менетила II  : Теперь когда плеть лишилась своего короля, она станет еще опасней")
    print("Теренаса Менетила II  : Ей нужен правитель")
    print("Теренаса Менетила II  : Всегда должен быть Король-лич")
    print("После этих слов дух его исчезает")
    print("Тирион поднимает Корону Господства")
    print("Тирион Фордринг : Это тяжкое бремя я возьму на себя.Ибо никто другой ..... ")
    print("Болвар Фордрагон : Тирион! Брат мой, в твоих руках суровый рок, но это не твоя судьба.")
    print("Обожженная фигура Болвара корчится на вершине Ледяного Трона.")
    print("Тирион Фордринг: Болвар!")
    print("Тирион Фордринг: Во имя всего святого...")
    print("Болвар Фордрагон: Пламя драконов определило мою судьбу. Мир живых уже не для меня. Возложи корону на мою голову, Тирион. Отныне я стану стражем Проклятых.")
    print("Тирион Фордринг: Нет, мой друг. Я не могу.")
    print("Болвар Фордрагон: Давай же, Тирион!")
    print("Болвар Фордрагон: И тебя и этих храбрых героев ждет иная судьба. А эту последнюю жертву принесу я.")
    print("Тирион поворачивается к Болвару и поднимает над ним Шлем Господства.")
    print("Тирион Фордринг: Тебя не забудут, брат.")
    print("Болвар Фордрагон: Обо мне нужно забыть, Тирион. Если миру суждено освободится от власти страха, никто не должен узнать, что произошло здесь сегодня!")
    print("Тирион выполняет требование Болвара и надевает на него Шлем Господства. Комната начинает трястись и Болвар поднимает голову: из его глаз идет золотистое свечение.")
    print("Болвар Фордрагон: Объяви что Король-лич мертв.")
    print("Голос Болвара постепенно становится похожим на голос Короля-лича.")
    print("Болвар Фордрагон/Король-лич: И вместе с ним умер Болвар Фордрагон.")
    print("Ледяной Трон сковывает в глыбу Болвара.")
    print("Болвар Фордрагон/Король-лич: А теперь уходи! И не возвращайся, никогда!")






    
    






